import React from 'react'
import Navbar from '@/app/components/Navbar'
import { Widget2 } from '@/app/components/Widget2'
import { FaCoins } from "react-icons/fa";
import { VscRadioTower } from "react-icons/vsc";
import { GiPassport } from "react-icons/gi";
import { FaLanguage } from "react-icons/fa6";

const berlinItems = [
    {
        name: 'Νόμισμα',
        icon: <FaCoins className="w-5 h-5" />,
        content: 'Το νόμισμα που χρησιμοποιούν είναι το ευρώ. Στα περισσότερα μαγαζιά δέχονται κάρτα αλλά είναι καλό να έχετε μαζί σας μερικά μετρητά',
    },
    {
        name: 'Roaming',
        icon: <VscRadioTower className="w-5 h-5" />,
        content: 'Η Γερμανία ανήκει στις χώρες που ισχύει το δωρεάν roaming, συνεπώς μπορείτε να χρησιμοποιείτε κανονικά τα λεπτά και τα δεδομένα σας',
    },
    {
        name: 'Έγγραφα',
        icon: <GiPassport className="w-5 h-5" />,
        content: 'Ταυτότητα/Διαβατήριο',
    },
    {
        name: 'Γλώσσα',
        icon: <FaLanguage className="w-5 h-5" />,
        content: 'Φυσικά μιλάνε Γερμανικά, όμως στα περισσότερα μαγαζία μπορούσαν να μιλήσουν αγγλικά και ήταν αρκετά εύκολο να συννενοηθούμε',
    },
];

function Berlin() {
    return (
        <div className="min-h-screen">
            <div><Navbar /></div>
            {/* Content with Padding to Account for Navbar */}
            <div className="pt-24 container mx-auto p-20">
                <h1 className="text-3xl font-bold text-[#2E2E2F] mb-4">
                    Βερολίνο: Τι να κάνω και τι να δω
                </h1>
                <p className="text-[#2E2E2F]">
                    Εξερευνήστε το Βερολίνο, μια πόλη γεμάτη ιστορία, πολιτισμό και νέες
                    εμπειρίες.
                </p>
                {/* Widget */}
                <div className="mt-8">
                    <Widget2 items={berlinItems} />
                </div>
                {/* Main sector */}
                <div className="mt-8">
                    <h2 className="text-2xl font-bold text-[#2E2E2F] mb-4">
                        1. Μεταφορά από το αεροδρόμιο
                    </h2>
                    <p>Όλες οι αεροπορικές εξυπηρετούν από το αεροδρόμιο του Βρανδεμβούργου (BER). Η μεταφορά γίνεται με το τρένο είτε την γραμμή S9 (συχνότερα δρομολόγια) είτε το τρένο FEX (γρηγορότερο). Το πιο σημαντικό είναι ότι για την μεταφορά θα πρέπει να βγάλετε το εισιτήριο σας προτού επιβιβαστείτε στο τρένο. Θα επιλέξετε αυτό που ανήκει και στις τρεις ζώνες ABC και έχει κόστος 4,40 ευρώ.  </p>
                </div>
                <div className="mt-8">
                    <h2 className="text-2xl font-bold text-[#2E2E2F] mb-4">
                        2. Μετακινήσεις εντός της πόλης
                    </h2>
                    <p>Το Βερολίνο είναι μια μεγάλη πόλη όπου θα χρησιμοποιήσετε αρκετά τα μέσα για τις μετακινήσεις σας εντός πόλης. Χωρίζεται σε 3 ζώνες όπου οι A και Β ανήκουν εντός του κέντρου της πόλης, ενώ στην C ανήκει το αεροδρόμιο ή το Potsdam.  Έτσι, θα πρέπει να επιλέξτε ανάμεσα στην επιλογή μεμονωμένων εισιτηρίων, ημερήσιων εισιτηρίων ή την επιλογή της Berlin Welcome Card ανάλογα με τις μέρες που θα διαθέσετε στην πόλη. Η Berlin Welcome Card παρέχει και διάφορες εκπτώσεις σε διάφορα αξιοθέατα.
                        Οι τιμές που κυμαίνονται στα μέσα είναι οι παρακάτω:
                        <li>Μεμονωμένο εισιτήριο (short trip ticket: έως 3 στάσεις μετρό ή 6 στάσεις τραμ ή λεωφορείο): 2,60 €</li>
                        <li>Μεμονωμένο εισιτήριο (2 ωρών): 3,80 €</li>
                        <li>Ημερήσιο εισιτήριο: 10,60 €</li>
                        <li>Berlin Welcome Card (3 ημέρες): 42.90 €</li>
                        <li>Berlin Welcome Card + Museum Islands (3 ημέρες): 62.50 €</li>
                        Στην Berlin Welcome Card υπάρχει η δυνατότητα της έκδοσης κάρτας για από 2 έως 6 ημέρες.
                    </p>
                </div>
                <div className="mt-8">
                    <h2 className="text-2xl font-bold text-[#2E2E2F] mb-4">
                        3. Διαμονή
                    </h2>
                    <p>Για την διαμονή σας στο Βερολίνο προτιμήστε κάποιο ξενοδοχείο που βρίσκεται πολύ κοντά σε κάποια στάση του μετρό, για την ευκολότερη σας μετακίνηση. Η πιο δημοφιλής περιοχή είναι το Mitte, όπου βρίσκεται στο κέντρο της πόλης και έχετε πρόσβαση έτσι στα περισσότερα αξιοθέατα. </p>
                </div>
                <div className="mt-8">
                    <h2 className="text-2xl font-bold text-[#2E2E2F] mb-4">
                        4. Πρόγραμμα
                    </h2>
                    <p>Τα αξιοθέατα στο Βερολίνο έχουν αρκετά μεγάλη απόσταση μεταξύ τους οπότε ένας καλός προγραμματισμός είναι απαραίτητος αν θέλουμε να δούμε όσο τα περισσότερα γίνεται. </p>
                </div>
                <div className="mt-8">
                    <h3 className="text-1xl font-bold text-[#2E2E2F] mb-4">
                        1η Ημέρα
                    </h3>
                    <p>Θα ξεκινήσουμε την περιήγηση από Alexanderplatz την πιο κεντρική πλατεία του Βερολίνου. Εκεί μπορούμε να ξεκινήσουμε με το Παγκόσμιο Ρολόι, όπου αναφέρεται η ώρα από διάφορες ώρες το κόσμου. Το επόμενο κοντινό αξιοθέατο είναι ο Πύργος της Τηλεόρασης, το ψηλότερο κτήριο του Βερολίνου και έχει ύψος 368 μέτρα. Το κόστος για την είσοδο είναι 23,50 ευρώ. Λίγα μέτρα δίπλα από το παγκόσμιο ρολόι θα παρατηρήσετε ένα μαγαζί με συνήθως αρκετά μεγάλη ουρά, το CURRY61 που μπορείτε να δοκιμάσετε το παραδοσιακό curry wurst.
                        Σε κοντινή απόσταση από την Alexanderplatz βρίσκεται το η Hackescher Markt μια συνοικία που διατηρεί ακόμη τις χρωματιστές art nouvo προσόψεις. Έχει τα καλύτερα cafe, εστιατόρια και φούρνους. Ενδεικτικά εμείς επισκεφτήκαμε το SOFI για branch, το LAP coffee, το ChickenBuzz, AERA για κρουασάν και το Cinnamood για cinnamon rolls. Σε κοντινή απόσταση υπάρχει και το κτήριο της Νέας Συναγωγής με έναν εντυπωσιακό τρούλο.
                        Αν υπάρχει ακόμα χρόνος μπορείτε να συνεχίσετε στο Rotes Rathaus. Είναι το δημαρχείο της πόλης και είναι ένα εντυπωσιακό κτήριο. Η είσοδος είναι δωρεάν ώστε να δείτε και το εσωτερικό του κτηρίου.
                        Τέλος, ακριβώς απέναντι από το δημαρχείο υπάρχει η περιοχή Nikolaiviertel. Είναι η πιο γραφική περιοχή στο Βερολίνο με τα πολύχρωμα σπιτάκια και την art nouvo αρχιτεκτονική. Μέσα σε αυτή την περιοχή υπάρχει και η St. Nicholas' Church Museum μια από τις παλαιότερες εκκλησίες της πόλης. Το κόστος για την είσοδο στην εκκλησία είναι 7 ευρώ.
                    </p>
                </div>
                <div className="mt-8">
                    <h3 className="text-1xl font-bold text-[#2E2E2F] mb-4">
                        2η Ημέρα
                    </h3>
                    <p>Θα συνεχίσουμε από την εκεί που μείναμε την προηγούμενη ημέρα και μπορούμε να δούμε το Νησί των Μουσείων. Είναι ένα εντυπωσιακό τεχνητό νησί πάνω στον ποταμό Spree όπου έχει μαζεμένα μουσεία και τον καθεδρικό ναό του Βερολίνου. Πιο αναλυτικά, υπάρχουν ο Berliner Dom έχει κόστος 10 ευρώ και μπορείτε εκτός από το να θαυμάσετε το εσωτερικό μπορείτε να ανέβετε μέχρι τον τρούλο ώστε να θαυμάσετε και την θέα από ψηλά. Το πιο διάσημο μουσείο αυτό της Περγάμου, το οποίο είναι κλειστό για ανακαίνιση έτσι εμείς ήταν αδυνατό να πάμε. Τα υπόλοιπα μουσεία είναι τα: Παλαιό Μουσείο (Altes Museum), Νέο Μουσείο (Neues Museum), Παλαιά Εθνική Πινακοθήκη (Alte Nationalgalerie) και το Μουσείο Μπόντε (Bode-Museum, γνωστό ως Μουσείο Κάιζερ-Φρίντριχ (Kaiser-Friedrich-Museum). Αν έχετε μια Berlin Welcome Card που σας δίνει πρόσβαση στα μουσεία τότε μπορείτε να μπείτε σε όλα με την χρήση του εισιτηρίου.
                        Αν υπάρχει χρόνος να συνεχίσετε στην Unter den Linden είναι ο μεγαλύτερος δρόμος του Βερολίνου, ιδιαίτερα τα Χριστούγεννα που είναι φωτισμένος είναι πραγματικά εντυπωσιακός. Μην ξεχάσετε να επισκεφτείτε το New Yorker Cookies, από τα καλύτερα cookies που έχουμε φάει. Το επόμενο μέρος που μπορούμε να επισκεφτούμε είναι η πλατεία Bebelplatz. Είναι μια όμορφη πλατεία και τα Χριστούγεννα εκεί υπάρχει και η Χριστουγεννιάτικη αγορά. Τέλος, ένα δωρεάν μουσείο που μπορούμε να επισκεφτούμε είναι το Tränenpalast, ένα παλιό σημείο διέλευσης των συνόρων, που τώρα στεγάζει μια μόνιμη έκθεση για την καθημερινή ζωή στη διαιρεμένη Γερμανία.

                    </p>
                </div>
                <div className="mt-8">
                    <h3 className="text-1xl font-bold text-[#2E2E2F] mb-4">
                        3η Ημέρα
                    </h3>
                    <p>Η Τρίτη ημέρα θα συνεχίσουμε την περιήγηση στο κέντρο της πόλης. Ξεκινώντας από την Unter den Linden μπορούμε να ξεκινήσουμε με το Gendarmenmarkt. Εκεί υπάρχουν δύο εκκλησίες στις οποίες η είσοδος είναι δωρεάν. Όταν την επισκεφτήκαμε εμείς η πλατεία ήταν κλειστή λόγω έργων που γινόντουσαν. Ανεβαίνοντας πάλι στην Unter den Linden στρίβουμε αριστερά ώστε να βρεθούμε στο σύμβολο της πόλης την Πύλη του Βρανδεμβούργου.
                        Το επόμενο στην λίστα μας είναι το Γερμανικό Κοινοβούλιο, η είσοδος είναι δωρεάν αλλά θα πρέπει να κάνετε την κράτηση σας δωρεάν online από το επίσημο site. Θα ανεβείτε μέχρι πάνω στον γυάλινο θόλο και θα σας δοθεί και digital guide.
                        Βγαίνοντας από το κοινοβούλιο και αφού περάσουμε πάλι από την πύλη του Βρανδεμβούργου κατευθυνθούμε στο Μνημείο Ολοκαυτώματος (Memorial to the Murdered Jews of Europe) αποτελείται από 2711 πέτρινους πλίνθους και είναι αφιερωμένα στα θύματα των Εβραίων από τους Ναζί. Η είσοδος είναι δωρεάν.
                        Συνεχίζοντας στην Gertrud-Kolmar-Straße θα βρεθούμε στο Mall of Berlin. Είναι ένα μεγάλο εμπορικό κέντρο και στον τελευταίο όροφο μπορείτε να βρείτε πολλά fast food και εστιατόρια. Λίγο πιο κάτω θα βρεθείτε στην Potsdamer Platz. Εκεί μην χάσετε την ευκαιρία να δοκιμάσετε donuts στο Brammibal's Donuts. Τώρα το επόμενο αξιοθέατο που θα επισκεφτούμε είναι το Topography of Terror. Είναι ένα πρώην αρχηγείο της Γκεστάπο, καταγράφοντας τη φρίκη του ναζισμού. Λίγα μέτρα παρακάτω υπάρχει το Checkpoint Charlie το οποίο ήταν το σημείο ελέγχου για την είσοδο και έξοδο στο Ανατολικό Βερολίνο.
                        Ένα ακόμα δωρεάν μουσείο είναι το Jewish Museum Berlin είναι το μεγαλύτερο εβραϊκό μουσείο στην Ευρώπη και δίνει στον επισκέπτη μια εικόνα των 1700 χρόνων γερμανοεβραϊκής ιστορίας.
                        Τέλος, θα χρειαστεί να πάρουμε το μετρό από το Hallesches Tor και να πάρουμε είτε τη γραμμή U1 ή την U3 και να κατέβουμε στην Warschauer Str. Εκεί υπάρχει το διάσημο East Side Gallery, η γέφυρα Oberbaumbrücke και η Uber Arena.

                    </p>
                </div>
                <div className="mt-8">
                    <h3 className="text-1xl font-bold text-[#2E2E2F] mb-4">
                        4η Ημέρα
                    </h3>
                    <p>Στην τέταρτη ημέρα θα χρειαστεί να μετακινηθούμε λίγο πιο μακριά από το κέντρο του Βερολίνου. Από την Alexanderplatz μπορούμε να πάρουμε το λεωφορείο 100 και να κατέβουμε στην στάση Großer Stern, ώστε να φτάσουμε στο πρώτο αξιοθέατο που είναι το Victory Column. Είναι μια εντυπωσιακή στήλη που στην κορυφή βρίσκεται ένα άγαλμα της θεάς Νίκης. Μπορούμε να ανέβουμε μέχρι πάνω και το κόστος είναι 4 ευρώ. Αν το επιτρέπει ο καιρός μετά μπορούμε να περιηγηθούμε στο Tiergarden, το μεγαλύτερο πάρκο του Βερολίνου.
                        Επόμενος σταθμός είναι ο Ζωολογικός Κήπος του Βερολίνου, είναι ο μεγαλύτερος της Ευρώπης. Το κόστος της εισόδου είναι στα 17 ευρώ. Είναι καλό να τα κλείσετε από νωρίς στο επίσημο site. Βγαίνοντας από την κεντρική πύλη του ζωολογικού σίγουρα θα έχουμε προσέξει το Kaiser Wilhelm Memorial Church. Μια πολύ όμορφη εκκλησία με δωρεάν είσοδος. Ακόμα μπορούμε να πάμε στο KaDeWe, το δεύτερο μεγαλύτερο εμπορικό κέντρο της Ευρώπης. Όμως, μέσα έχει τα ακριβότερα brands του κόσμου. Αφού είστε εκεί αξίζει μια επίσκεψη στο AERA για καφέ ή πρωινό και στο San Sebastian Café the Original για ένα cheesecake.
                        Τελευταίο αξιοθέατο στην σημερινή ημέρα είναι το Charlottenburg Palace. Για να φτάσουμε εκεί θα χρειαστεί να πάρουμε το λεωφορείο Μ45. Κατασκευασμένο το 1699 ως θερινή κατοικία της Σοφίας Σάρλοτ, συζύγου του βασιλιά Φρειδερίκου Α’. Η είσοδος στο παλάτι κοστίζει 12 ευρώ

                    </p>
                </div>
                <div className="mt-8">
                    <h3 className="text-1xl font-bold text-[#2E2E2F] mb-4">
                        5η Ημέρα
                    </h3>
                    <p>Σε ένα πολύ συμπιεσμένο πρόγραμμα, μπορείτε να δείτε σχεδόν τα βασικά αξιοθέατα του Βερολίνου. Αν έχετε κάποια ακόμα μέρα και θέλετε να δείτε κάτι διαφορετικό τότε μπορείτε να επισκεφτείτε μια κοντινή πόλη, το Potsdam.
                        Αρχικά, η πρόσβαση στο Potsdam γίνεται εύκολα μέσω τρένου της γραμμή S7. Υπενθυμίζω ότι το εισιτήριο θα πρέπει να είναι για την γραμμή C. Το τρένο κάνει περίπου 40 λεπτά να φτάσει στο Potsdam. Το google maps θα προτείνει να πάρετε το τραμ για να φτάσετε στο κέντρο της πόλης. Αντίθετα προτείνουμε να βγείτε έξω και να αρχίστε να περπατάτε μέχρι το κέντρο της πόλης.

                        Το πρώτο που θα δούμε είναι η πλατεία με την εκκλησία St. Nicholas' Church η είσοδος στην οποία είναι δωρεάν. Σε εκείνη την πλατεία θα βρούμε ακόμα Potsdam Museum, εμείς δεν το επισκεφτήκαμε. Αν συνεχίσουμε ευθεία θα περάσουμε την πλατεία Platz der Einheit και θα φτάσουμε στο πλακόστρωτο πιο γραφικό σημείο της πόλης. Με διάφορα café και εμπορικά μαγαζιά. Αν θέλετε να πιείτε καφέ ή να φάτε κάτι μπορείτε να επιλέξτε το Cafe Kaiserwetter ή Café Miss Green Bean.
                        Μετά μπορείτε να συνεχίσετε στην Ολλανδική συνοικία με τα ομοιόμορφα σπίτια με το χαρακτηριστικό κόκκινο τούβλο, όπως και την Nauener Tor. Το Potsdam έχει ακόμα και μια μικρότερη Ρωσική συνοικία με τα χαρακτηριστικά σπίτια από ξύλο. Το Potsdam διαθέτει και την δική του, μικρότερη Πύλη του Βρανδεμβούργου που μπορείτε να περάσετε. Ακριβώς δίπλα από την πύλη υπάρχει το Spieluhr - Gottfried Höfe που είναι μια χρυσή μπάλα από πορσελάνη που χτυπάει κάθε ώρα.  Πρόκειται για ένα music box σχεδιασμένο από τον Gottfried Hörer το 1977.
                        Τέλος, ένα από τα πιο διάσημα αξιοθέατα του Potsdam είναι το πάρκο Schlosspark Sanssouci με το εντυπωσιακό ανάκτορο του, έχοντας ως πρότυπο τις Βερσαλλίες. Η είσοδος στο παλάτι κοστίζει 14 ευρώ. Βέβαια η περιήγηση στο εσωτερικό του παλατιού δεν έχει τεράστιο ενδιαφέρον. Θα ήταν κάτι που θα μπορούσατε να παραλείψετε.
                        Αυτό που αξίζει πραγματικά είναι το εξωτερικού του παλατιού το οποίο είνα δωρεάν. ιδιαίτερα, αν έχετε την τύχη να το επισκεφτείτε την ανοίξη οι ανθισμένοι κήποι δίνουν μια εντελώς διαφορετική αίσθηση.
                    </p>
                </div>

            </div>
        </div>



    )
}

export default Berlin